Revit 2026 API

# DataConversionMonitorScope Properties

---

The DataConversionMonitorScope type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

DataConversionMonitorScope Class

Autodesk.Revit.DB Namespace